{
    "BattleUnitKind":
    [
        {
            "HP": "Sets HP value",
            "dangerHP": "Sets Danger HP value",
            "perilHP": "Sets Peril HP value",
            "level": "Sets the targets level\nStar Point value is enemy Level minus Mario's level multiplied by a value that changes depending on how many enemies exist at the start of battle\n0.5X for 1-2 enemies, 0.55x for 3 enemies, 0.65x for 4 enemies, and 0.75x for 5 enemies\nNote that new enemies spawned mid-battle always use the 0.5x multiplier",
            "bonusXP": "Flat increase to Star Points gained\nThis amount is added after all calculations are done from the levels\nBonus XP is not given if Mario has a higher level than the enemy",
            "bonusCoin": "Amount of extra coins you can earn from an enemy",
            "bonusCoinRate": "The chance of gaining the Bonus Coins, the probability is rolled for each Bonus Coin",
            "baseCoin": "The base amount of coins dropped from an enemy",
            "runRate": "What % of the Run Meter is filled when starting to run, the meters starting position is the average of all enemies Run rate",
            "pbCap": "The maximum number of Power Bounce hits you can land in a single attack",
            "swallowChance": "Yoshi's chance to swallow the target, 255 = Disabled",
            "swallowAttribute": "None - Swallow with no knockback\nSwallow Bomb - Unused, happens when gulping an ignited Bob-Omb, extra Animation Only\nSpit Into Other Enemy - Gulp that spits into the next enemy\nSpit Fireball - Unused, Gulps and spits fireballs if used on a fiery target\nSwallow Part Of Enemy - Unused, only works on Pokey, swallows parts/head",
            "ultraHammerKnockChance": "The chance of Super/Ultra hammer causing Knockback",
            "itemStealParameter": "What % of the meter on Kiss Thief is a successful action command, 100 = Full Bar",
            "MapObj": "Sets actors target position to 300 units back, this has an in-game effect of making that target no longer frontmost if other enemies are in the battle",
            "OutOfReach": "Makes the target out of reach, seems to be used when target is on the ceiling",
            "Unquakeable": "Makes the target immune to Quake",
            "IsInvisible": "Makes the target invisible, seems to just be the invisible status",
            "IsVeiled": "Makes the target act as if they are veiled, if set on an enemy they will be veiled at the start of battle and never be able to be hit",
            "ShellShielded": "Makes the target act as if they are Shell Shielded, does nothing if target does not have a Shell Shield",
            "NeverTargetable": "Makes the target untargetable with any attacks",
            "LimitSwitch": "Flag use currently unknown",
            "DisableZeroGravityFloat": "Disables the floating effect from the unused zero gravity battle effect",
            "DisableZeroGravityImmobility": "Disables the immobility caused  from the unused zero gravity battle effect",
            "immuneToUltraHammerKnock": "Makes the target immune to knockback from Super/Ultra Hammer",
            "IsUndead": "When enabled, stops the target from dying when they reach 0HP",
            "IsCorpse": "This flag is used when any of the Dry Bones variants are in their downed state",
            "IsLeader": "Designates target as a leader\nAll leaders must be defeated on Mario's side for a game over to occur\nThis flag seems to have no effect on enemies",
            "CannotTakeActions": "When enabled on a target it prevents them from taking any actions",
            "NotSpunByLoveSlap": "When set, the target is immune to the visual effect of the Love Slap damage patterns",
            "DisableDamageStars": "When set, the target does not display the damage stars and number when taking damage",
            "DisableAllPartVisibility": "When enabled, this flag disables the visibility of all parts relating to the target",
            "DisableHPGauge": "Disables the HP Gauge in battle",
            "LookCamera": "Flag use currently unknown",
            "NonCombatant": "Flag use currently unknown",
            "NoShadow": "Disables the visibility of the targets shadow",
            "DisableDamage": "This flag sets the target to be immune to taking damage\nDoes not prevent damage numbers from appearing, but health will not lower"
        }
    ],
    "BattleUnitKindPart":
    [
        {
            "MainBodyPart": "Flag use currently unknown",
            "SecondaryBodyPart": "Flag use currently unknown",
            "BombableBodyPart": "Flag use currently unknown",
            "GuardBodyPart": "Flag use currently unknown",
            "NotBombableBodyPart": "When this flag is enabled the part becomes immune to any attack with the flag OnlyTargetSelectParts",
            "InHole": "Sets the target to always be frontmost, this seems to cause most if not all attacks to miss",
            "WeakToAttackFxR": "Determines if target has a weakness to Attack FXR\nDoesn't work when enabled on enemies\nIf disabled on Hooktail her attack still drops, just not her defense\nWhen enabled on Hooktail it can pierce up to 2 defense, whether its Base Defense or Status Defense",
            "WeakToIcePower": "Determines if target is weak to Ice Power, target takes +1 damage.",
            "IsWinged": "Decides if an target has wings\nDoes nothing if enabled on a normal enemy\nIf disabled on a winged target then said target will not drop/lose wings when hit.",
            "IsShelled": "Determines if an target has a shell\nDoes nothing if enabled on a normal enemy\nIf disabled on a shelled target then said target will not flip when jumped on.",
            "IsBombFlippable": "Decides if an target is flipped by Bomb attacks\nDoes nothing when enabled on a normal enemy, unless said target is normally flippable\nIf disabled on a bomb flippable target then said target will not flip when hit with a Bomb attack.",
            "IsClonelike": "Makes an enemy clonelike, similar to a Wizzerd/Magikoopa clone",
            "DisableFlatPaperLayering": "When enabled, makes an invisible target appear strangely, the model is no longer flattened\nEnabling on an target that has it disabled by default changes nothing about the invisible status\nThis flag also makes the Dodgy idle animation not play, however the Dodgy dodge animation still plays",
            "NeverTargetable": "This flag prevents the target from being targeted",
            "IgnoreMapObjectOffset": "This flag ignores the offset from Is Map Object",
            "IgnoreOnlyTargetSelectAndPreferredParts": "This flag gives the target immunity to OnlyTargetSelectParts and OnlyTargetPreferredParts",
            "Untattleable": "The target can not be tattled",
            "JumplikeCannotTarget": "Jump attacks and other similar attacks cannot target the target",
            "HammerlikeCannotTarget": "Hammer attacks and other similar attacks cannot target the target",
            "ShellTosslikeCannotTarget": "Shell Toss and other similar attacks cannot target the target",
            "PreventHealthDecrease": "This flag sets the target to be immune to taking damage\nDoes not prevent damage numbers from appearing, but health will not lower",
            "DisablePartVisibility": "When enabled, this flag disables the visibility of the model the Part Struct is related to",
            "ImmuneToCustom": "This flag prevents attacks with the flag CustomAttackType from targeting the target\nThis flag functions on Mario/Partner and enemies\nThis flag has a side effect of disabling some animations and shadows",
            "BlurOn": "Flag use currently unknown",
            "ScaleIndependence": "Flag use currently unknown",
            "Independence": "Seems to be used on certain parts to handle moving objects",
            "IsImmuneToDamageOrStatus": "Target cannot be inflicted with statuses or take damage from attacks, superguards can still damage the target",
            "IsImmuneToOHKO": "Target cannot be defeated by the OHKO status",
            "IsImmuneToStatus": "The target can not be inflicted with any status",
            "TopSpiky": "Sets the target to be top spiky",
            "PreemptiveFrontSpiky": "Sets the target to be front spiky and interrupt attacks that walk up to it\nOnly Bristle has this effect in vanilla",
            "FrontSpiky": "Sets the target to be front spiky",
            "Fiery": "Sets the target to be fiery on contact\nUser takes 1 damage on contact\nNo damage is dealt to the target",
            "FieryStatus": "Sets the target to inflict burn on contact\nNo damage is dealt to the target",
            "Icy": "Sets the target to be icy on contact\nUser takes 1 damage on contact\nNo damage is dealt to the target",
            "IcyStatus": "Sets the target to inflict freeze on contact\nNo damage is dealt to the target",
            "Poison": "Sets the target to be poisonous on contact\nUser takes 1 damage on contact\nTarget also receives damage",
            "PoisonStatus": "Sets the target to inflict poison on contact\nTarget also receives damage",
            "Electric": "Sets the target to be electric on contact\nUser takes 1 damage on contact\nNo damage is dealt to the target",
            "ElectricStatus": "Sets the target to inflict electric on contact\nUser takes 1 damage on contact\nNo damage is dealt to the target\nOnce user has electric status they can make contact with the target",
            "Explosive": "Sets the target to be explosive\nFire and Explosive attacks will cause target to be defeated instantly",
            "VolatileExplosive": "Sets the target to be Volatile Explosive, any form of contact/damage/item used on the target will cause said target to be immediately defeated\nIf contact is made user takes 1 damage"
        }
    ],
    "HealthUpgrades":
    [
        {
            "startHP": "Sets Mario's base HP",
            "startFP": "Sets Mario's base FP",
            "startBP": "Sets Mario's base BP",
            "upgradeHP": "Sets how much to upgrade HP by per level",
            "upgradeFP": "Sets how much to upgrade FP by per level",
            "upgradeBP": "Sets how much to upgrade BP by per level",
            "PARTNER1": "Sets base rank HP",
            "PARTNER2": "Sets super rank HP",
            "PARTNER3": "Sets ultra rank HP"
        }
    ],
    "BattleUnitDefense":
    [
        {
            "normal": "Sets targets base defense",
            "fire": "Sets targets defense to fire attacks",
            "ice": "Sets targets defense to icy attacks",
            "explosion": "Sets targets defense to explosive attacks",
            "electric": "Sets targets defense to electric attacks"
        }
    ],
    "BattleUnitDefenseAttr":
    [
        {
            "normal": "Sets what happens when a target is hit by a normal attack\nNo Effect - Nothing unique happens when the target is hit\nWeak To - Target is weak to this attribute, target takes +1 damage from hits\nImmune To - Target cannot be damaged with this attribute\nAbsorbs - When hit with this attribute the target takes no damage and heals based on the attacks damage\nImmune To (Except Gulp) - This target is immune to this attribute type, unless the attack is Gulp, Iron Clefts use this in vanilla",
            "fire": "Sets what happens when a target is hit by a fire attack\nNo Effect - Nothing unique happens when the target is hit\nWeak To - Target is weak to this attribute, target takes +1 damage from hits\nImmune To - Target cannot be damaged with this attribute\nAbsorbs - When hit with this attribute the target takes no damage and heals based on the attacks damage\nImmune To (Except Gulp) - This target is immune to this attribute type, unless the attack is Gulp, Iron Clefts use this in vanilla",
            "ice": "Sets what happens when a target is hit by a ice attack\nNo Effect - Nothing unique happens when the target is hit\nWeak To - Target is weak to this attribute, target takes +1 damage from hits\nImmune To - Target cannot be damaged with this attribute\nAbsorbs - When hit with this attribute the target takes no damage and heals based on the attacks damage\nImmune To (Except Gulp) - This target is immune to this attribute type, unless the attack is Gulp, Iron Clefts use this in vanilla",
            "explosion": "Sets what happens when a target is hit by a explosive attack\nNo Effect - Nothing unique happens when the target is hit\nWeak To - Target is weak to this attribute, target takes +1 damage from hits\nImmune To - Target cannot be damaged with this attribute\nAbsorbs - When hit with this attribute the target takes no damage and heals based on the attacks damage\nImmune To (Except Gulp) - This target is immune to this attribute type, unless the attack is Gulp, Iron Clefts use this in vanilla",
            "electric":"Sets what happens when a target is hit by a electric attack\nNo Effect - Nothing unique happens when the target is hit\nWeak To - Target is weak to this attribute, target takes +1 damage from hits\nImmune To - Target cannot be damaged with this attribute\nAbsorbs - When hit with this attribute the target takes no damage and heals based on the attacks damage\nImmune To (Except Gulp) - This target is immune to this attribute type, unless the attack is Gulp, Iron Clefts use this in vanilla"
        }
    ],
    "StatusVulnerability":
    [
        {
            "sleep": "Sets the probability that the target can be inflicted with Sleep. Final status probability is (Susceptibility * Attack Status Chance)",
            "stop": "Sets the probability that the target can be inflicted with Stop. Final status probability is (Susceptibility * Attack Status Chance)",
            "dizzy": "Sets the probability that the target can be inflicted with Dizzy. Final status probability is (Susceptibility * Attack Status Chance)",
            "poison": "Sets the probability that the target can be inflicted with Poison. Final status probability is (Susceptibility * Attack Status Chance)",
            "confuse": "Sets the probability that the target can be inflicted with Confusion. Final status probability is (Susceptibility * Attack Status Chance)",
            "electric": "Sets the probability that the target can be inflicted with Electrified. Final status probability is (Susceptibility * Attack Status Chance)",
            "burn": "Sets the probability that the target can be inflicted with Burn. Final status probability is (Susceptibility * Attack Status Chance)",
            "freeze": "Sets the probability that the target can be inflicted with Freeze. Final status probability is (Susceptibility * Attack Status Chance)",
            "huge": "Sets the probability that the target can be inflicted with Huge. Final status probability is (Susceptibility * Attack Status Chance)",
            "tiny": "Sets the probability that the target can be inflicted with Tiny. Final status probability is (Susceptibility * Attack Status Chance)",
            "attack_up": "Sets the probability that the target can be inflicted with Attack Up. Final status probability is (Susceptibility * Attack Status Chance)",
            "attack_down": "Sets the probability that the target can be inflicted with Attack Down. Final status probability is (Susceptibility * Attack Status Chance)",
            "defense_up": "Sets the probability that the target can be inflicted with Defense Up. Final status probability is (Susceptibility * Attack Status Chance)",
            "defense_down": "Sets the probability that the target can be inflicted with Defense Down. Final status probability is (Susceptibility * Attack Status Chance)",
            "allergic": "Sets the probability that the target can be inflicted with Allergic. Final status probability is (Susceptibility * Attack Status Chance)",
            "fright": "Sets the probability that the target will be Frightened. Final status probability is (Susceptibility * Attack Status Chance)",
            "gale_force": "Sets the probability that the target will be Blown Away. Final status probability is (Susceptibility * Attack Status Chance)",
            "fast": "Sets the probability that the target can be inflicted with Fast. Final status probability is (Susceptibility * Attack Status Chance)",
            "slow": "Sets the probability that the target can be inflicted with Slow. Final status probability is (Susceptibility * Attack Status Chance)",
            "dodgy": "Sets the probability that the target can be inflicted with Dodgy. Final status probability is (Susceptibility * Attack Status Chance)",
            "invisible": "Sets the probability that the target can be inflicted with Invisibility. Final status probability is (Susceptibility * Attack Status Chance)",
            "ohko": "Sets the probability that the target will be OHKO'd. Final status probability is (Susceptibility * Attack Status Chance)"
        }
    ],
    "BattleWeapon":
    [
        {
            "accuracy": "Probability the attack will hit\nCan be set above 100% to reduce effects of dizzy/dodgy",
            "fp_cost": "The amount of FP needed to use an attack\nThis does nothing when set on an enemy",
            "sp_cost": "The amount of SP Orbs an attack costs to use\nThis does work when set on an enemy attack, it will drain Mario's SP",
            "superguard_state": "Sets how a superguard will impact the target\nUnsuperguardable - This attack can not be superguarded\nSuperguardable with Recoil - This attack can be superguarded and the enemy will take 1 damage\nSuperguardable without Recoil - This attack can be superguarded but the enemy will not take damage",
            "sylish_multiplier": "Impacts the amount of Star Power and Audience gained when using a stylish\n0 Will yield very little\nHas no impact on an attack if the stylish is not performed\nCan not be disabled with -1/255",
            "bingo_slot_inc_chance": "Sets the chance that the attack will add a Bingo Slot\n0 Disables\nDoesn't work with enemy attacks",
            "base_damage_fn": "None - When set this function makes the attack do no damage, no parameters will do anything, badges that increase power will also have no effect\nGet Jump Power - This function makes the attack scale with jump power, as you upgrade your boots this attack will grow stronger\nGet Hammer Power - This function makes the attack scale with hammer power, as you upgrade your hammer this attack will grow stronger\nGet Default Power - This function makes the attack call damage parameter 1 for damage, regardless of an action command success/fail\nGet Badge Stacked Jump Power - This function makes the attack scale with jump power, also enables badge damage scaling with parameters 7 and 8\nGet Tornado Power - This function makes the attack damage behave like the Tornado Jump Tornadoes, does not actually add tornadoes to an attack, damage scaling badges still increase damage\nGet Badge Stacked Hammer Power - This function makes the attack scale with hammer power, also enables badge damage scaling with parameters 7 and 8\nGet Art Attack Power - This function makes the attack damage behave like Art Attack, since Art Attack is handled by its script this function behaves similar to \"None\" on all other attacks\nGet Supernova Power - This function makes the attack damage behave like Supernova, since Supernova is handled by its script this function behaves similar to \"Get Default Power\" on all other attacks\nGet Earth Tremor Power - This function makes the attack damage behave like Earth Tremor, since Earth Tremor is handled by its script this function makes all other attacks do 1 damage regardless of what damage parameters are set\nGet Poison Shroom Power - This function makes the attack damage behave like Poison Shroom (Bingo), an attack with this flag will deal half of the targets HP, subtracting defense if applicable\nGet Partner Power - This function makes the attack scale in power based on partner rank, since this requires checking the rank of a partner it seems to make all other attacks do 1 damage regardless of what damage parameters are set\nGet Partner Action Command Power - This function makes the attack check for action command success when using an attack, used in a lot of attacks that have multiple success and fail states",
            "base_damage1": "Get Jump Power - Normal Boots damage with a failed action command damage\nGet Hammer Power -Normal Hammer damage with a failed action command damage\nGet Default Power - Sets the attacks damage, regardless of an action command success/fail\nGet Badge Stacked Jump Power - Normal Boots damage with a failed action command damage\nGet Tornado Power - The base damage of the attack\nGet Badge Stacked Hammer Power - Normal Hammer damage with a failed action command damage\nGet Supernova Power - Sets the attacks damage, regardless of an action command success/fail\nGet Partner Power - Base Rank Partner failed action command damage\nGet Partner Action Command Power - Functions differently depending on the value and type of move",
            "base_damage2": "Get Jump Power - Normal Boots damage with a successful action command damage\nGet Hammer Power - Normal Hammer damage with a successful action command damage\nGet Badge Stacked Jump Power - Normal Boots damage with a successful action command damage\nGet Tornado Power - The amount of damage each extra copy of Tornado Jump adds to the attack\nGet Badge Stacked Hammer Power - Normal Hammer damage with a successful action command damage\nGet Partner Power - Base Rank Partner successful action command damage\nGet Partner Action Command Power - Sets base damage for the attack",
            "base_damage3": "Get Jump Power - Super Boots damage with a failed action command damage\nGet Hammer Power - Super Hammer damage with a failed action command damage\nGet Badge Stacked Jump Power - Super Boots damage with a failed action command damage\nGet Badge Stacked Hammer Power - Super Hammer damage with a failed action command damage\nGet Partner Power - Super Rank Partner failed action command damage",
            "base_damage4": "Get Jump Power - Super Boots damage with a successful action command damage\nGet Hammer Power - Super Hammer damage with a successful action command damage\nGet Badge Stacked Jump Power - Super Boots damage with a successful action command damage\nGet Badge Stacked Hammer Power - Super Hammer damage with a successful action command damage\nGet Partner Power - Super Rank Partner successful action command damage",
            "base_damage5": "Get Jump Power - Ultra Boots damage with a failed action command damage\nGet Hammer Power - Ultra Hammer damage with a failed action command damage\nGet Badge Stacked Jump Power - Ultra Boots damage with a failed action command damage\nGet Badge Stacked Hammer Power - Ultra Hammer damage with a failed action command damage\nGet Partner Power - Ultra Rank Partner failed action command damage",
            "base_damage6": "Get Jump Power - Ultra Boots damage with a successful action command damage\nGet Hammer Power - Ultra Hammer damage with a successful action command damage\nGet Badge Stacked Jump Power - Ultra Boots damage with a successful action command damage\nGet Badge Stacked Hammer Power - Ultra Hammer damage with a successful action command damage\nGet Partner Power - Ultra Rank Partner successful action command damage",
            "base_damage7": "Get Badge Stacked Jump Power - Badge ID for badge stacking damage, any badge ID works in this parameter and will scale damage based on parameter 8\nGet Badge Stacked Hammer Power - Badge ID for badge stacking damage, any badge ID works in this parameter and will scale damage based on parameter 8",
            "base_damage8": "Get Badge Stacked Jump Power - Value for increase or decrease in damage from stacked badges, can be set to positive or negative\nGet Badge Stacked Hammer Power - Value for increase or decrease in damage from stacked badges, can be set to positive or negative",
            "base_fpdamage1": "Amount of FP drained, this only functions on Flower Fuzzy in vanilla",
            "base_fpdamage2": "Unused FP Damage Parameter",
            "base_fpdamage3": "Unused FP Damage Parameter",
            "base_fpdamage4": "Unused FP Damage Parameter",
            "base_fpdamage5": "Unused FP Damage Parameter",
            "base_fpdamage6": "Unused FP Damage Parameter",
            "base_fpdamage7": "Unused FP Damage Parameter",
            "base_fpdamage8": "Unused FP Damage Parameter",
            "CannotTargetMarioOrShellShield": "Attack can not target Mario or a Shell Shield",
            "CannotTargetPartner": "Attack used can not target the partner character, works when set on Mario and enemies",
            "CannotTargetEnemy": "Attack used can not target an enemy, this seems to do nothing when set on an enemy",
            "CannotTargetTreeOrSwitch": "Seems to go unused, enabled on all attacks, disabling seems to change nothing",
            "CannotTargetSystem": "Prevents the attack from targeting system units\nBomb Squad counts as a system unit, so if an attack has this flag disabled, said attack can target Bomb Squad bombs",
            "CannotTargetOppositeAlliance": "The attack used cannot target the side opposite of the user",
            "CannotTargetOwnAlliance": "The attack used cannot target the users own Alliance",
            "CannotTargetSelf": "The attack used cannot target the user",
            "CannotTargetSameSpecies": "The attack used cannot target the same type of target as the attacks user",
            "OnlyTargetSelf": "The attack used can only target the user",
            "OnlyTargetMario": "The attack used will only target Mario",
            "OnlyTargetTreeOrSwitch": "Makes the attack only able to target Tree or Switch",
            "OnlyTargetPreferredParts": "Makes the selected attack only able to target certain parts\nThis flag seems to only matter in fights with enemies that have multiple parts",
            "OnlyTargetSelectParts": "Makes the attack only able to target certain parts\nOnly used on Bomb Squad in vanilla, and seems to disable hitting multiple parts on bosses that have them",
            "SingleTarget": "Makes the attack only target a single target",
            "MultipleTarget": "Makes the attack target all enemies except for those immune due to other flags",
            "CannotTargetAnything": "Completely disables targeting options for the attack",
            "Tattlelike": "Makes the attack be considered tattle-like, meaning a target that can't be tattled can't be targeted by the attack",
            "CannotTargetFloating2": "The attack will not be able to target a floating target\nOnly used on Fuzzy Horde in vanilla",
            "CannotTargetCeiling": "The attack will not be able to target an target on the ceiling",
            "CannotTargetFloating": "The attack will not be able to target a floating target",
            "CannotTargetGrounded": "The attack will not be able to target an target on the ground",
            "Jumplike": "Makes the attack Jump-like, meaning a target with Jump-like Attacks Cannot Target set can not be targeted by this attack",
            "Hammerlike": "Makes the attack Hammer-like, meaning a target with Hammer-like Attacks Cannot Target set can not be targeted by this attack",
            "ShellTosslike": "Makes the attack Shell Toss-like, meaning a target with Shell Toss-like Attacks Cannot Target set can not be targeted by this attack",
            "CannotTargetGroundedVariant": "A broken version of Cannot Target Grounded\nIf an attack is Jump-like or has no attack likeness set, it cannot target grounded targets\nIf an attack is Shell Toss-like or Hammer-like it loses all targeting options",
            "RecoilDamage": "Only enabled on Super Hammer 2, Ultra Hammer 2, and Gulp 5\nDoesn't seem to do anything when enabled/disabled",
            "CanOnlyTargetFrontmost": "Makes the attack only able to target the frontmost target",
            "CannotTargetShellShield": "Disables targeting targets with a Shell Shield",
            "CannotTargetCustom": "Gives the attack an Unused Attack Type property\nThis seems to do nothing unless the target has the Is Immune To Custom Type flag, in which case this attack can not target that entity",
            "TargetSameAllianceDirection": "Makes the attack target order follow the opposite direction the user is facing",
            "TargetOppositeAllianceDirection": "Makes the attack target order follow the direction the user is facing",
            "element": "Sets the attacks element: Normal, Fire, Ice, Explosive, or Electric",
            "damage_pattern": "Decides what effects are on an attack, some are visual and some have functions\nNone - No effect\nGulp Knocked onto Ground 1 - Visual only, Gulp Knockback\nGulp Knocked onto Ground 2 - Visual only, buggy animations\nGulp Knocked into next Target - Does Gulp knockback\nRemove Segment - This is set on most Shell moves, this property is what allows Shell moves to remove Pokey segments\nSquashed - Visual, squishes at different lengths\nInked - Visual, Blooper Ink\nSuper Hammer Knocked Back - Does Super Hammer Knockback\nUltra Hammer Knocked Back - Incredibly buggy\nUltra Hammer Finisher - When enabled on an attack it will not play an FX sound if you have the FX badges equipped, also the damage woosh visual when an enemy takes damage is slightly bigger\nConfusion Effect - Visual, confused effect\nLove Slap Spin 1/2 - Visual, spin\nLove Slap Quick Spin 1/2 - Visual, quick spin\nBlown Away - Visual, blows enemy away (seems to only work on defeating hit)\nPlay Additional Ending Hurt Animation - Seems to be the finishing hit on some multi-hit attacks to ensure a 0HP target is defeated",
            "ac_level": "Determines how difficult an action command is\nExtremely Easy - 3 Simplifiers\nVery Easy - 2 Simplifiers\nEasy - 1 Simplifier\nNone - Base\nDifficult - 1 Unsimplifier\nVery Difficult - 2 Unsimplifiers\nExtremely Difficult - 3 Unsimplifiers",
            "BadgeCanAffectPower": "Determines if badges modify the power of the attack\nThis does not have any impact on stacking offensive badges when disabled",
            "StatusCanAffectPower": "Determines if statuses modify the power of the attack",
            "IsChargeable": "Determines if charge increases the power of the attack",
            "CannotMiss": "The attack cannot miss\nThis setting ignores invisible, dodgy, and dizzy, lucky, and veil",
            "DiminishingReturnsByHit": "Damage decreases on your attack by 1 per hit, but never to 0",
            "DiminishingReturnsByTarget": "Damage decreases on your attack by 1 per target hit, but never to 0",
            "PiercesDefense": "Makes the attack ignore all forms of defense, whether base, elemental, status, badges, and the defend action\nDoes not ignore P-Down D-Up or Guards",
            "CanBreakIce": "Flag use currently unknown",
            "IgnoreTargetStatusVulnerability": "Makes the attack ignore status vulnerabilities",
            "SPFx200": "Flag use currently unknown",
            "IgnitesIfBurned": "If the user is burned then the attack will be changed into the fire element",
            "PlayActiveFXSound": "Enables FX sounds based on which FX badges the user has on",
            "FlipsShellEnemies": "Attack will flip the enemy if they are shelled\nDoes nothing if Is Shelled is set on an enemy without a shell",
            "FlipsBombFlippableEnemies": "Attack will flip the enemy if they are normally Bomb-Flippable\nDoes nothing if Is Bomb-Flippable is set on an enemy without normally being Bomb-Flippable",
            "GroundsWingedEnemies": "Attack will ground winged enemies\nDoes nothing if Is Winged is set on an enemy without wings",
            "SPFx8000": "Flag use currently unknown",
            "CanBeUsedAsConfusedAction": "The attack can be called as a random confused attack with this flag set",
            "Unguardable": "The attack can not be guarded, this flag also disables superguarding",
            "CanHitClonelike": "Attack will be able to target and make contact with a clone enemy",
            "Electric": "Ignores Electric Resistance",
            "TopSpiky": "Ignores Top Spiky Resistance",
            "PreemptiveFrontSpiky": "Ignores Preemptive Front Spiky Resistance",
            "FrontSpiky": "Ignores Front Spiky Resistance",
            "Fiery": "Ignores Fire Resistance",
            "Icy": "Ignores Ice Resistance",
            "Poison": "Ignores Poison Resistance",
            "Explosive": "Ignores Explosive Resistance",
            "VolatileExplosive": "Ignores Volatile Explosive Resistance",
            "Payback": "Ignores Payback Resistance",
            "HoldFast": "Ignores Hold Fast Resistance",
            "PreferMario": "Makes Mario's weight 50% higher",
            "PreferPartner": "Makes Partner's weight 50% higher",
            "PreferFront": "Multiplies the weights by 0.5, 0.9, 1.3, etc. from back to front",
            "PreferBack": "Multiplies the weights by 0.5, 0.9, 1.3, etc. from front to back",
            "PreferSameAlliance": "Makes teammates' weights 50% higher",
            "PreferOppositeAlliance": "Makes opposing alliance weights 50% higher",
            "PreferLessHealthy": "Multiplies weights by (2.0 - target's current fraction of Max HP)",
            "GreatlyPreferLessHealthy": "Multiplies weights by (1.0 - target's current fraction of Max HP)",
            "PreferLowerHP": "Multiplies weights by (1.5 - target's current HP/20)",
            "PreferHigherHP": "Multiplies weights by (1.5 + target's current HP/20)",
            "PreferInPeril": "Multiplies weights of a target in Peril by 50%",
            "TWFx2000": "Flag use currently unknown",
            "ChooseWeightedRandomly": "Picks from the final weights randomly",
            "sleep_chance": "Chance of inflicting Sleep",
            "sleep_time": "Duration of inflicted Sleep",
            "stop_chance": "Chance of inflicting Stop",
            "stop_time": "Duration of inflicted Stop",
            "dizzy_chance": "Chance of inflicting Chance",
            "dizzy_time": "Duration of inflicted Dizzy",
            "poison_chance": "Chance of inflicting Poison",
            "poison_time": "Duration of inflicted Poison",
            "poison_strength": "Strength of Inflicted Poison",
            "confuse_chance": "Chance of inflicting Confusion",
            "confuse_time": "Duration of inflicted Confusion",
            "electric_chance": "Chance of inflicting Electrified",
            "electric_time": "Duration of inflicted Electrified",
            "dodgy_chance": "Chance of inflicting Dodgy",
            "dodgy_time": "Duration of inflicted Dodgy",
            "burn_chance": "Chance of inflicting Burn",
            "burn_time": "Duration of inflicted Burn",
            "freeze_chance": "Chance of inflicting Freeze",
            "freeze_time": "Duration of inflicted Freeze",
            "size_change_chance": "Chance of inflicting a Size Change",
            "size_change_time": "Duration of an inflicted Size Change",
            "size_change_strength": "Strength of an Inflicted Size Change",
            "atk_change_chance": "Chance of inflicting Attack Change",
            "atk_change_time": "Duration of an inflicted Attack Change",
            "atk_change_strength": "Strength of an Inflicted Attack Change",
            "def_change_chance": "Chance of inflicting Defense Change",
            "def_change_time": "Duration of an inflicted Defense Change",
            "def_change_strength": "Strength of an Inflicted Defense Change",
            "allergic_chance": "Chance of inflicting Allergic",
            "allergic_time": "Duration of inflicted Allergic",
            "ohko_chance": "Chance of OHKO",
            "charge_strength": "Strength of an Inflicted Charge",
            "fast_chance": "Chance of inflicting Fast",
            "fast_time": "Duration of inflicted Fast",
            "slow_chance": "Chance of inflicting Slow",
            "slow_time": "Duration of inflicted Slow",
            "fright_chance": "Chance of inflicting Fright",
            "gale_force_chance": "Chance of Blowing Away",
            "payback_time": "Duration of inflicted Payback",
            "hold_fast_time": "Duration of inflicted Hold Fast",
            "invisible_chance": "Chance of inflicting Invisible",
            "invisible_time": "Duration of inflicted Invisibility",
            "hp_regen_time": "Duration of inflicted HP Regen",
            "hp_regen_strength": "Strength of Inflicted HP Regen",
            "fp_regen_time": "Duration of inflicted FP Regen",
            "fp_regen_strength": "Strength of Inflicted FP Regen",
            "attack_evt": "Attack Scripts change what move is used when an attack is selected",
            "stage_background_fallweight1": "Probability of making small and large stage objects fall",
            "stage_background_fallweight2": "Probability of making large stage objects fall",
            "stage_background_fallweight3": "Probability of making small stage objects fall",
            "stage_background_fallweight4": "Probability of making the background wall fall",
            "stage_nozzle_turn_chance": "The probability that the nozzles on the stage change targets",
            "stage_nozzle_fire_chance": "The probability that the nozzles on the stage will fire",
            "stage_ceiling_fall_chance": "The chance the ceiling will fall",
            "stage_object_fall_chance": "Sets the probability that a stage prop will fall"
        }
    ]
}